Repository: feyton/igiti
Catalog: locale/*/LC_MESSAGES/django.po
Languages: rw

source: English
rw: Icyongereza

source: Categories
rw: Ibyiciro

source: author facebook
rw: konti ya facebook y'umwanditsi

source: author twitter
rw: konti ya twitter y'umwanditsi

source: telephone
rw: Nimero ya telefoni y'umwanditsi

source: Author Image
rw: ifoto y'umwanditsi

source: author biography
rw: Ubuzima bw'umwanditsi

source: title
rw: umutwe

source: slug
rw: impine

source: image
rw: ifoto

source: text
rw: ibirimo

source: description
rw: imiterere

source: published
rw: yashyizwe hanze

source: created
rw: yakozwe

source: modified
rw: yahinduwe

source: publish date
rw: igihe yashyiriwe hanze

source: blog post
rw: inkuru

source: blog posts
rw: inkuru

source: full name
rw: Amazina yose

source: Email
rw: Imeyili

source: Comment
rw: igitekerezo

source: Reply
rw: Igisubizo

source: storage type
rw: ubwoko bw'ububiko

source: Min storage years
rw: imyaka myinshi yabikwa

source: overview
rw: mu buryo burambuye

source: scientific name
rw: izina

source: common name
rw: izina rusange

source: image1
rw: ifoto ya 1

source: image2
rw: ifoto ya 2

source: price
rw: ikiguzi

source: discount
rw: igabanya

source: Seeds per Kilogram
rw: Imbuto ziri mu kilo

source: Short description
rw: Incamake

source: mobile number
rw: nimero ya telefoni

source: Account Inactive
rw: Konti irafubze

source: This account is inactive.
rw: Iyi konti irafunze

source: Account
rw: Konti

source: Log In
rw: Injira

source: Account permission required.
rw: Uburenganzira burakenewe

source: Login to continue
rw: Injira muri konti yawe

source: Log In with
rw: Injira ukoresheje

source: OR
rw: Cyangwa

source: You don't have acount
rw: Nta konti ufite?

source: Sign Up Here
rw: Iyandikishe hano

source: Forgot password
rw: Wibagiwe ijambo ry'ibanga

source: Reset
rw: Saba irishya

source: Sign Out
rw: Gusohoka

source: Are you sure you want to sign out?
rw: Ushaka gusohoka kurubuga?

source: Change Password
rw: Hindura ijambo banga

source: Current Password
rw: Wibagiwe ijambo ry'ibanga

source: Password
rw: Wibagiwe ijambo ry'ibanga

source: Change password
rw: Wibagiwe ijambo ry'ibanga

source: Password Reset
rw: Hindura ijambo banga

source: Forgotten your password? Enter your e-mail address below, and we'll send you an e-mail allowing you to reset it.
rw: Wibagiwe ijambo banga? Injiza imeyili yawe ahakurikira ubone ubutumwa bukwemerera kurihindura

source: Please contact us if you have any trouble resetting your password.
rw: Tumenyeshe mugihe ugize ikibazo uhindura ijambo banga

source: Bad Token
rw: Code ntabwo yemewe

source: change password
rw: hindura ijambo banga

source: Your password is now changed.
rw: Ijambo banga ryahindutse

source: Set Password
rw: Ongeraho ijambo banga

source: Register
rw: Saba irishya

source: REGISTER HERE
rw: IYANDIKISHE HANO

source: Terms and Conditions
rw: Amategeko n'amabwiriza

source: REGISTER
rw: IYANDIKISHE HANO

source: Login Here
rw: Injira

source: Sign Up Closed
rw: Kwiyandikisha byarahagaze

source: We are sorry, but the sign up is currently closed.
rw: Ihangane, kwiyandikisha byarahagaritswe

source: Verify Your E-mail Address
rw: Emeza imeyili yawe

source: Read more
rw: Soma ibikurikira

source: Sorry, we do not have posts in this category yet
rw: Ihangane, nta nkuri ziri muriki kiciro

source: Category
rw: Ikiciro

source: Author
rw: ifoto y'umwanditsi

source: Published
rw: yashyizwe hanze

source: Views
rw: Abayisomye

source: Follow me
rw: Nkurikira

source: Add or View comments
rw: Ongera cyangwa urebe ibitekerezo

source: Leave a comment
rw: Tanga igitekerezo

source: Date
rw: itariki

source: Be the first to comment
rw: Ba uwambere gutanga igitekerezo

source: Search
rw: Shakisha

source: Popular Posts
rw: Inkuru zasomwe cyane

source: Publications
rw: Inkuru

source: Recent Posts
rw: Inkuru nshya

source: Trending Posts
rw: Inkuru zikunzwe

source: Read More
rw: Soma

source: Store
rw: Iduka

source: Privacy Policy
rw: Ikoresha ry'amakuru

source: Subscribe to our newsletter
rw: Iyandikishe kwakira imeyili zacu

source: Subscribe
rw: Iyandikishe

source: Powered by
rw: Bikorwa na

source: Home
rw: Ahabanza

source: Blog
rw: Inkuru

source: Events
rw: Ibikorwa

source: Checkout
rw: Haha

source: Dashboard
rw: Page yanjye

source: Logout
rw: Sohoka

source: You want to explore the forest. Don't miss out!
rw: Ushaka kumenya ibijyanye n'ishyamba. Ntucikwe!

source: We will take you to the place you will like the most. Create account and join us.
rw: Turakugeza ahantu uzakunda kurushaho. Fungura konti udacikwa.

source: Create account
rw: Fungura konti

source: Thank You for creating the account.
rw: Wakoze kwiyandikisha.

source: Update your profile
rw: Shyira amakuru kugihe

source: Welcome to Igiti Corp
rw: Urakaza neza

source: Visit our library and get the best out of our website. Don't forget calculators.
rw: Sura inkuru twanditse. Ntiwibagirwe kureba udushya twakuzaniye

source: Visit our Library
rw: Soma inkuru

source: Check out our store for seeds and seedlings.
rw: Reba ibicuruzwa biri mwiduka ryacu.

source: Order seeds or seedlings and get them delivered to your desired place.
rw: Tumiza imbuto cyangwa ingemwe uzishyikirire aho wahisemo.

source: Visit store
rw: Sura iduka

source: Top Choices
rw: Amahitamo meza

source: We got you covered on each category of forestry information.
rw: Urahasanga amakuru atandukanye ajyanye n'ishyamba

source: The Best Services
rw: Serivisi nziza

source: Simply the Largest library
rw: Ikusanyirizo rinini ry'amakuru

source: Modern Nursery Management
rw: Iterambere mukwita kubiti

source: Join Now
rw: Iyandikishe nonaha

source: User must have an email address
rw: Uwiyandikisha agomba kuba afite imeyili

source: User must have a first name
rw: Uwiyandikisha agomba kuzuza izina ry'idini

source: User must have a last name
rw: Uwiyandikisha agomba kuzuza izina ry'ababyeyi

source: email address
rw: imeyili

source: first name
rw: Izina ry'idini

source: last name
rw: Izina ry'umuryango

source: active
rw: ikora

source: staff status
rw: icyiciro cy'ukoresha urubuga

source: Designates whether the user can log into this admin site.
rw: Bigena niba usuye urubuga yemerewe kwinjira muri konti isumba izindi

source: date joined
rw: itariki wiyandikishije

source: user
rw: ukoresha urubuga

source: users
rw: abakoresha urubuga
